#### SpecUtils Members

---

|  |
| --- |
| SpecUtils Class   Methods   See Also |

The  SpecUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAllSpecs | Gets the identifiers of all specs. |
| Public method Static member | IsSpec | Checks whether a ForgeTypeId identifies a spec. |
| Public method Static member | IsValidDataType | Returns true if the given ForgeTypeId identifies a valid parameter data type. |

# See Also

SpecUtils Class

Autodesk.Revit.DB Namespace